https://www.tutorialspoint.com/python/python_database_access.htm

In [1]:
import sqlite3
from sqlalchemy import create_engine
import pandas as pd
import glob

In [2]:
# Replace spaces with underscore
def replacespace(col):
    return [col.replace(' ', '_') for col in col]

In [3]:
def replacespacer(col):
    tmp = [col.replace(' ', '_') for col in col]
    tmp = [col.strip(':') for col in tmp]
    tmp = [col.strip('?') for col in tmp]
    tmp = [col.replace('/', '_') for col in tmp]
    return tmp

# Update Tables

In [9]:
allCourses_columns = ['course_name', 'acronym', 'cost_model']

In [74]:
def updateCourselistTable(course_name, acronym, cost_model):
    msg = ''
    try:
        con = sqlite3.connect(dbpath)
        cursor = con.cursor()        
        gl1 = """Update course_list set course_name = ?, cost_model = ? """
        gl2 = """where acronym = ?"""
        sqlite_update_query = gl1+gl2        
        columnValues = (course_name, cost_model, acronym)
        con.commit()
        msg = "Course_List updated successfully!"       
        cursor.close()

    except sqlite3.Error as error:
        msg = f"Course_List update failed due to {error}."
    finally:
        if con:
            con.close()
    return msg

In [11]:
registrant_columns = ['course_id','course_abb','mmyyyy','course_type',
                      'First Name:','Last Name:','Email Address:','Address 1:',
                      'City:','State:', 'Education Level:', 'Country:',
                      'ZIP Code:','Phone:','Company/School:', 'Job Title:',
                      'Department:','How did you hear about this course?',
                      'Registration Date','Registration Status',
                      'Payment Status','Payment Type','Fee Type', 'Promo Code',
                      'Code Type', 'Discount Percent','Discount Amount',
                      'Total Price']
len(registrant_columns)

28

In [12]:
replacespacer(registrant_columns)

['course_id',
 'course_abb',
 'mmyyyy',
 'course_type',
 'First_Name',
 'Last_Name',
 'Email_Address',
 'Address_1',
 'City',
 'State',
 'Education_Level',
 'Country',
 'ZIP_Code',
 'Phone',
 'Company_School',
 'Job_Title',
 'Department',
 'How_did_you_hear_about_this_course',
 'Registration_Date',
 'Registration_Status',
 'Payment_Status',
 'Payment_Type',
 'Fee_Type',
 'Promo_Code',
 'Code_Type',
 'Discount_Percent',
 'Discount_Amount',
 'Total_Price']

In [75]:
reg1 = """Update registrants set course_abb= ?, mmyyyy= ?, """
reg2 = """course_type= ?, First_Name= ?, Last_Name= ?, Email_Address= ?, """ 
reg3 = """Address_1= ?, City= ?, State= ?, Education_Level= ?, Country= ?, """ 
reg4 = """ZIP_Code= ?,Phone= ?, Company_School= ?, Job_Title= ?, """ 
reg5 = """Department= ?, How_did_you_hear_about_this_course= ?, """ 
reg6 = """Registration_Date= ?,Registration_Status= ?, Payment_Status= ?, """ 
reg7 = """Payment_Type= ?,Fee_Type= ?, Promo_Code= ?, Code_Type= ?, """ 
reg8 = """Discount_Percent= ?, Discount_Amount= ?, Total_Price= ? """
reg9 = """where course_id= ? """
sqlite_update_query = reg1+reg2+reg3+reg4+reg5+reg6+reg7+reg8+reg9
sqlite_update_query

'Update registrants set course_abb= ?, mmyyyy= ?, course_type= ?, First_Name= ?, Last_Name= ?, Email_Address= ?, Address_1= ?, City= ?, State= ?, Education_Level= ?, Country= ?, ZIP_Code= ?,Phone= ?, Company_School= ?, Job_Title= ?, Department= ?, How_did_you_hear_about_this_course= ?, Registration_Date= ?,Registration_Status= ?, Payment_Status= ?, Payment_Type= ?,Fee_Type= ?, Promo_Code= ?, Code_Type= ?, Discount_Percent= ?, Discount_Amount= ?, Total_Price= ? where course_id= ? '

In [76]:
def updateRegistrantsTable(course_id, course_abb, mmyyyy, course_type,
                            First_Name, Last_Name, Email_Address, Address_1,
                            City, State, Education_Level, Country, ZIP_Code,
                            Phone, Company_School, Job_Title, Department,
                            How_did_you_hear_about_this_course, Registration_Date,
                            Registration_Status, Payment_Status, Payment_Type,
                            Fee_Type, Promo_Code, Code_Type, Discount_Percent,
                            Discount_Amount, Total_Price):
    msg = ''
    try:
        con = sqlite3.connect(dbpath)
        cursor = con.cursor()        
        reg1 = """Update registrants set course_abb= ?, mmyyyy= ?, """
        reg2 = """course_type= ?, First_Name= ?, Last_Name= ?, Email_Address= ?, """ 
        reg3 = """Address_1= ?, City= ?, State= ?, Education_Level= ?, Country= ?, """ 
        reg4 = """ZIP_Code= ?,Phone= ?, Company_School= ?, Job_Title= ?, """ 
        reg5 = """Department= ?, How_did_you_hear_about_this_course= ?, """ 
        reg6 = """Registration_Date= ?,Registration_Status= ?, Payment_Status= ?, """ 
        reg7 = """Payment_Type= ?,Fee_Type= ?, Promo_Code= ?, Code_Type= ?, """ 
        reg8 = """Discount_Percent= ?, Discount_Amount= ?, Total_Price= ? """
        reg9 = """where course_id= ? """
        sqlite_update_query = reg1+reg2+reg3+reg4+reg5+reg6+reg7+reg8+reg9      
        columnValues = (course_abb, mmyyyy, course_type,
                            First_Name, Last_Name, Email_Address, Address_1,
                            City, State, Education_Level, Country, ZIP_Code,
                            Phone, Company_School, Job_Title, Department,
                            How_did_you_hear_about_this_course, Registration_Date,
                            Registration_Status, Payment_Status, Payment_Type,
                            Fee_Type, Promo_Code, Code_Type, Discount_Percent,
                            Discount_Amount, Total_Price, course_id)
        cursor.execute(sqlite_update_query, columnValues)        
        msg = "Registrants_Table was updated successfully!"
        con.commit()
        cursor.close()

    except sqlite3.Error as error:
        msg = f"Registrants_Table update failed due to {error}."
    finally:
        if con:
            con.close()
    return msg

In [14]:
grade_columns = ['course_id','course_abb','mmyyyy','course_type','Last Name',
                 'First Name', 'Username', 'Student ID','Last Access',
                 'Availability', 'Final Exam', 'Final Grade']

In [15]:
def updateGradeTable(course_id,course_abb,mmyyyy,course_type,Last_Name,
                 First_Name,Username, Student_ID,Last_Access,
                 Availability, Final_Exam, Final_Grade):
    msg = ''
    try:
        con = sqlite3.connect(dbpath)
        cursor = con.cursor()        
        gl1 = f"""Update grade_report set course_abb = ?,mmyyyy= ?, """
        gl2 = """course_type = ?, Last_Name = ?, First_Name = ?, """
        gl3 = """Username = ?, Student_ID = ?, Last_Access = ?, """
        gl4 = """Availability = ?, Final_Exam = ?, Final_Grade = ? """
        gl5 = """where course_id = ?"""
        sqlite_update_query = gl1+gl2+gl3+gl4+gl5
        
        columnValues = (course_abb,mmyyyy,course_type,Last_Name,
                 First_Name,Username, Student_ID,Last_Access,
                 Availability, Final_Exam, Final_Grade, course_id)
        cursor.execute(sqlite_update_query, columnValues)        
        msg = "Grade_Table was updated successfully!"
        con.commit()
        cursor.close()

    except sqlite3.Error as error:
        msg = f"Grade_Table update failed due to {error}."
    finally:
        if con:
            con.close()
    return msg

In [16]:
cost_columns = ['course_id','course_abb','mmyyyy','course_type','Name','Role',
                'Pay','Type','Location']

In [17]:
def updateCostTable(course_id, course_abb, mmyyyy, course_type,
                    Name, Role, Pay, Type, Location):
    msg = ''
    try:
        con = sqlite3.connect(dbpath)
        cursor = con.cursor()        
        gl1 = f"""Update cost_model set course_abb = ?,mmyyyy= ?, """
        gl2 = """course_type = ?, Name = ?, Role = ?, """
        gl3 = """Pay = ?, Type = ?, Location = ? """        
        gl4 = """where course_id = ?"""
        sqlite_update_query = gl1+gl2+gl3+gl4
        
        columnValues = (course_abb, mmyyyy, course_type,
                        Name, Role, Pay, Type, Location, course_id)
        cursor.execute(sqlite_update_query, columnValues)
        con.commit()
        msg = "Cost_Table was updated successfully!"
        con.commit()
        cursor.close()

    except sqlite3.Error as error:
        msg = f"Grade_Table update failed due to {error}."
    finally:
        if con:
            con.close()
    return msg

In [18]:
demog_columns = ['course_id', 'course_abb','mmyyyy', 'course_type', 'object',
                 'by', 'count']

In [19]:
def updateDemographyTable(course_id, course_abb, mmyyyy, course_type,
                                                  object, by, count):
    msg = ''
    try: 
        con = sqlite3.connect(dbpath)
        cursor = con.cursor()        
        gl1 = f"""Update demography set course_abb = ?, mmyyyy= ?, """
        gl2 = """course_type = ?, object = ?, by = ?, """
        gl3 = """count = ? where course_id = ? """         
        sqlite_update_query = gl1+gl2+gl3        
        columnValues = (course_abb, mmyyyy, course_type,
                            object, by, count, course_id)
        cursor.execute(sqlite_update_query, columnValues)        
        msg = "Demography_Table was updated successfully!"
        con.commit()
        cursor.close()

    except sqlite3.Error as error:
        msg = f"Demography_Table update failed due to {error}."
    finally:
        if con:
            con.close()
    return msg

In [20]:
# The same
sur_columns = ['course_id','course_abb','mmyyyy','course_type','questions',
               'opinion','scores','count']

In [21]:
def updateSurveysTable(course_id, course_abb, mmyyyy, course_type,
                                questions, opinion, scores, count):
    msg = ''
    try:
        con = sqlite3.connect(dbpath)
        cursor = con.cursor()        
        gl1 = f"""Update surveys set course_abb = ?, mmyyyy= ?, """
        gl2 = """course_type = ?, questions = ?,  opinion = ?, """
        gl3 = """scores = ?, count = ? where course_id = ? """         
        sqlite_update_query = gl1+gl2+gl3       
        columnValues = (course_abb, mmyyyy, course_type,
                        questions, opinion, scores, count, course_id)
        cursor.execute(sqlite_update_query, columnValues)  
        msg = "Surveys_Table was updated successfully!"
        con.commit()
        cursor.close()

    except sqlite3.Error as error:
        msg = f"Surveys_Table update failed due to {error}."
    finally:
        if con:
            con.close()
    return msg

# Grab Tables

In [102]:
def check_tables(dbpath):
    msg = ''
    try:
        con = sqlite3.connect(dbpath)
        cursor = con.cursor()
        cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
        tab = cursor.fetchall()
        table_list = []
        for t in list(tab):
            table_list.append(t[0])
        msg = "Tables grabbed successfully!"
    except sqlite3.Error as error:
        msg = f"Grade_Table update failed due to {error}."
    finally:
        if con:
            con.close()
    return table_list, msg

In [125]:
tt = "/home/alem/Desktop/dash/py_and_db/DashProjDB.db"
table_list, msg = check_tables(tt)
table_list

['course_list',
 'registrants',
 'grade_report',
 'demography',
 'surveys',
 'cost_model']

In [112]:
dbpath = tt
qerrydb(dbpath, tbls['reg'], allcols['reg']).head(2)

,course_id,course_abb,mmyyyy,course_type,First Name:,Last Name:,Email Address:,Address 1:,City:,State:,...,Registration Date,Registration Status,Payment Status,Payment Type,Fee Type,Promo Code,Code Type,Discount Percent,Discount Amount,Total Price
0,AA_2020_09_09,AA,09/09/2020,public,Caleb,Qi,cqi2@binghamton.edu,55 Fairview Avenue,Great Neck,New York,...,09/09/2020 10:24:26 AM EDT,Registered,Paid,PayPal,BU Students/SUNY Students (must be matriculate...,None,None,NaN,None,95.0
1,AA_2020_09_09,AA,09/09/2020,public,Jack,Fischer,jfische8@binghamton.edu,29 Tamarack Pl,Briarcliff Manor,New York,...,07/20/2020 10:01:00 PM EDT,Registered,Paid,PayPal,BU faculty/staff/alumni graduated Dec. 2019 or...,None,None,NaN,None,150.0

In [127]:
tmpths = glob.glob("/home/alem/Desktop/dash/DB_Tables/*.xlsx")
tmpths

['/home/alem/Desktop/dash/DB_Tables/registrants.xlsx',
 '/home/alem/Desktop/dash/DB_Tables/grade_report.xlsx',
 '/home/alem/Desktop/dash/DB_Tables/frac_setting.xlsx',
 '/home/alem/Desktop/dash/DB_Tables/course_list.xlsx',
 '/home/alem/Desktop/dash/DB_Tables/demography.xlsx',
 '/home/alem/Desktop/dash/DB_Tables/surveys.xlsx',
 '/home/alem/Desktop/dash/DB_Tables/cost_model.xlsx']

In [129]:
tt = "/home/alem/Desktop/dash/py_and_db/DashProjDB.db"
dbpath = tt

In [130]:
df = pd.read_excel('/home/alem/Desktop/dash/DB_Tables/course_list.xlsx')
tosqlite(df, "course_list", dbpath, 'acl')

'course_list wasn added to DB!'

In [131]:
df = pd.read_excel('/home/alem/Desktop/dash/DB_Tables/registrants.xlsx')
tosqlite(df, "registrants", dbpath, 'reg')

'registrants wasn added to DB!'

In [132]:
df = pd.read_excel('/home/alem/Desktop/dash/DB_Tables/grade_report.xlsx')
tosqlite(df, "grade_report", dbpath, 'gra')

'grade_report wasn added to DB!'

In [133]:
df = pd.read_excel('/home/alem/Desktop/dash/DB_Tables/demography.xlsx')
tosqlite(df, "demography", dbpath, 'dem')

'demography wasn added to DB!'

In [134]:
df = pd.read_excel('/home/alem/Desktop/dash/DB_Tables/surveys.xlsx')
tosqlite(df, "surveys", dbpath, 'svy')

'surveys wasn added to DB!'

In [135]:
df = pd.read_excel('/home/alem/Desktop/dash/DB_Tables/cost_model.xlsx')
tosqlite(df, "cost_model", dbpath, 'cml')

'cost_model wasn added to DB!'

In [136]:
df = pd.read_excel('/home/alem/Desktop/dash/DB_Tables/frac_setting.xlsx')
tosqlite(df, "frac_setting", dbpath, 'set')

'frac_setting wasn added to DB!'

# Insert
https://pythonexamples.org/python-sqlite3-insert-multiple-rows-to-table/
https://pythonexamples.org/python-sqlite3-tutorial/

In [108]:
val = 'VALUES('
for i in range(3):
    val += '?,'
val = val.rstrip(',') +');'
val

'VALUES(?,?,?);'

In [109]:
def insert_Record(df, tblname, flag, label):
    if isinstance(df, bool) == False:
    len(df.columns)
    try:
        con = sqlite3.connect(dbpath)
        cursor = con.cursor()
        val = 'VALUES('
        for i in range(colnum):
            val += '?,'
        val = val.rstrip(',') +');'
        cursor.executemany(f"INSERT INTO {tblname}" + val, records);
        #commit the changes to db
        conn.commit()
    except:
        return sys.exc_info()[0]
    finally:
        if conn:
            #close the connection
            conn.close()
    return f"Records were sucessfully inserted into {tblname} in DB!"

In [111]:
df = pd.read_excel('./DB_Tables/grade_report.xlsx')
len(df.columns)

12

In [ ]:
import sqlite3

conn = sqlite3.connect('mysqlite.db')
c = conn.cursor()

#records or rows in a list
records = [(1, 'Glen', 8),
			(2, 'Elliot', 9),
			(3, 'Bob', 7)]

#insert multiple records in a single query
c.executemany('INSERT INTO students VALUES(?,?,?);',records);

print('We have inserted', c.rowcount, 'records to the table.')

#commit the changes to db			
conn.commit()
#close the connection
conn.close()

# ToSQLite
- allCourses_columns registrant_columns grade_columns cost_columns demog_columns  sur_columns
- table_names = ['course_list', 'registrants', 'demography','cost_model',
            'grade_report', 'surveys','checklist']

In [30]:
allcols = {'acl' : allCourses_columns, 
           'reg' : registrant_columns, 
           'gra' : grade_columns,
           'cml' : cost_columns,
           'dem' : demog_columns,
           'svy' : sur_columns}
tbls  = {'acl':'course_list', 'reg':'registrants', 
         'dem':'demography', 'cml':'cost_model',
         'gra':'grade_report', 'svy':'surveys'}

In [97]:
def filtab(df, dbtab, cid):
    interval = []
    if isinstance(df, bool)==False:
        lst1 = df[cid].tolist()
        if isinstance(dbtab, bool)==False:
            lst2 = dbtab[cid].tolist()
            interval.append(set(lst1).intersection(set(lst2)))
    if interval:
        return False
    else:
        return df

In [100]:
def tosqlite(dbpath, df,dbtab, cid, flag, tab_name,tabmsg1,mode, label, rplc = False):
    error = replaces= [] 
    if rplc == False:
        df = filtab(df, dbtab, cid)
    if isinstance(df, bool)== False and flag == None:
        try:
            con = sqlite3.connect(dbpath)
            cursor = con.cursor()
            engine = create_engine('sqlite:///'+dbpath, echo=False)              
            if label == 'reg':
                df.columns = replacespacer(df.columns)
            else:
                df.columns = replacespace(df.columns)
            # mode = 'append'/'replace'
            df.to_sql(tab_name, engine, if_exists=mode, index=False)
            if mode == 'append':
                error.append(f"Section-4: {tabmsg1} was successfully appended to db!")
            if mode == 'replace' and tab_name != 'frac_setting':
                error.append(f"Section-4: {tabmsg1} was successfully replaced in db!")
                replaces.append(tab_name)
        except sqlite3.Error as error:            
            error.append(f"{tblname} wasn't added to DB due to {error}.")
        else:
            error.append(f"{tblname} wasn added to DB!")       
        finally:
            if con:
                con.close()
    elif flag == False:
        error.append(f"Section-4: Check columns mismatch in {tabmsg1} file!")
    else:
        error.append(f"Section-4: No {tabmsg1} input and nothing was iserted"
               +" to DB or table might be already in DB!")
    return error, replaces

In [101]:
allf = None
dfall = pd.read_excel('./DB_Tables/course_list.xlsx')
acl1 = qerrydb(dbpath, tbls['acl'], allcols['acl'])
tosqlite(dbpath, dfall, acl1, 'acronym', allf, tbls['acl'],
                'Course List File', 'acl','append')

(['Section-4: No Course List File input and nothing was iserted to DB or table might be already in DB!'],
 ['Section-4: No Course List File input and nothing was iserted to DB or table might be already in DB!'])

In [118]:
def tosqlite(df, tblname, dbpath, label):
    msg = '' 
    if isinstance(df, bool)== False:
        try:
            con = sqlite3.connect(dbpath)
            cursor = con.cursor()    
            engine = create_engine('sqlite:///'+dbpath, echo=False)  
            if label == 'reg':
                df.columns = replacespacer(df.columns)
            else:
                df.columns = replacespace(df.columns)
            df.to_sql(tblname, engine, if_exists='append',index=False)            
        except sqlite3.Error as error:            
            msg = f"{tblname} wasn't added to DB due to {error}."
        else:
            msg = f"{tblname} wasn added to DB!"       
        finally:
            if con:
                con.close()
    else:
        msg = f"Check {tblname}, it is empty and not added to DB!"  
    return msg

In [63]:
dbpath = 'alemdb'
df = pd.read_excel('./DB_Tables/course_list.xlsx')
tosqlite(df, "course_list", dbpath, 'acl')

'course_list wasn added to DB!'

In [64]:
dbpath = 'alemdb'
df = pd.read_excel('./DB_Tables/registrants.xlsx')
tosqlite(df, "registrants", dbpath, 'reg')

'registrants wasn added to DB!'

In [65]:
dbpath = 'alemdb'
df = pd.read_excel('./DB_Tables/grade_report.xlsx')
tosqlite(df, "grade_report", dbpath, 'gra')

'grade_report wasn added to DB!'

In [66]:
dbpath = 'alemdb'
df = pd.read_excel('./DB_Tables/demography.xlsx')
tosqlite(df, "demography", dbpath, 'dem')

'demography wasn added to DB!'

In [67]:
dbpath = 'alemdb'
df = pd.read_excel('./DB_Tables/surveys.xlsx')
tosqlite(df, "surveys", dbpath, 'cml')

'surveys wasn added to DB!'

In [68]:
dbpath = 'alemdb'
df = pd.read_excel('./DB_Tables/cost_model.xlsx')
tosqlite(df, "cost_model", dbpath, 'cml')

'cost_model wasn added to DB!'

# Querry Tables

In [104]:
def qerrydb(dbpath, tblname, col):  
    try:
        engine = create_engine('sqlite:///'+dbpath, echo=False)
        df = pd.DataFrame(engine.execute(f"Select DISTINCT * from {tblname}"), 
                     columns=col)          
    except:
        msg = f"{tblname} doesn't exist or columns don't match!"
        return msg
    else:
        return df

In [88]:
['course_list', 'registrants', 'demography','cost_model',
      'grade_report', 'surveys','checklist']

['course_list',
 'registrants',
 'demography',
 'cost_model',
 'grade_report',
 'surveys',
 'checklist']

In [72]:
dbpath = 'alemdb'
qerrydb(dbpath, tbls['reg'], allcols['reg']).head(2)

,course_id,course_abb,mmyyyy,course_type,First Name:,Last Name:,Email Address:,Address 1:,City:,State:,...,Registration Date,Registration Status,Payment Status,Payment Type,Fee Type,Promo Code,Code Type,Discount Percent,Discount Amount,Total Price
0,AA_2020_09_09,AA,09/09/2020,public,Caleb,Qi,cqi2@binghamton.edu,55 Fairview Avenue,Great Neck,New York,...,09/09/2020 10:24:26 AM EDT,Registered,Paid,PayPal,BU Students/SUNY Students (must be matriculate...,None,None,NaN,None,95
1,AA_2020_09_09,AA,09/09/2020,public,Jack,Fischer,jfische8@binghamton.edu,29 Tamarack Pl,Briarcliff Manor,New York,...,07/20/2020 10:01:00 PM EDT,Registered,Paid,PayPal,BU faculty/staff/alumni graduated Dec. 2019 or...,None,None,NaN,None,150

In [73]:
dbpath = 'alemdb'
codes = ['acl', 'reg', 'cml', 'svy', 'dem','gra']
for cc in codes:
    print(f"---- {cc}---------")
    print(qerrydb(dbpath, tbls[cc], allcols[cc]).head(2))
    print()

---- acl---------
           course_name acronym    cost_model
0         AI Workshop      AIW  Face to face
1  Advanced Algorithms      AA        Online

---- reg---------
       course_id course_abb      mmyyyy course_type First Name: Last Name:  \
0  AA_2020_09_09         AA  09/09/2020      public       Caleb         Qi
1  AA_2020_09_09         AA  09/09/2020      public        Jack    Fischer

            Email Address:          Address 1:             City:    State:  \
0      cqi2@binghamton.edu  55 Fairview Avenue        Great Neck  New York
1  jfische8@binghamton.edu      29 Tamarack Pl  Briarcliff Manor  New York

   ...           Registration Date Registration Status Payment Status  \
0  ...  09/09/2020 10:24:26 AM EDT          Registered           Paid
1  ...  07/20/2020 10:01:00 PM EDT          Registered           Paid

  Payment Type                                           Fee Type Promo Code  \
0       PayPal  BU Students/SUNY Students (must be matriculate...       None
1       PayPal  BU faculty/staff/alumni graduated Dec. 2019 or...       None

  Code Type Discount Percent Discount Amount Total Price
0      None              NaN            None          95
1      None              NaN            None         150

[2 rows x 28 columns]

---- cml---------
        course_id course_abb      mmyyyy course_type             Name  \
0   AA_2020_09_09         AA  09/09/2020      public  Anand Seetharam
1  APS_2020_01_06        APS  06/01/2020      public        Shuxia Lu

         Role   Pay     Type Location
0  Instructor  0.25  percent       in
1  Instructor  0.25  percent       in

---- svy---------
        course_id course_abb      mmyyyy course_type  \
0  APS_2020_06_29        APS  29/06/2020      public
1  ItA_2020_07_29        ItA  29/07/2020      public

                                        questions opinion  scores  count
0       Your Likelihood to Recommend this course?     9.0       0      2
1  Contribution of course to your skill/knowledge    Fair       2      1

---- dem---------
       course_id course_abb      mmyyyy course_type  \
0  AA_2020_09_09         AA  09/09/2020      public
1  AA_2020_09_09         AA  09/09/2020      public

                                              object         by  count
0                                             Alumni  job_title      1
1  BU Students/SUNY Students (must be matriculate...   Fee Type      1

---- gra---------
         course_id course_abb      mmyyyy course_type Last Name First Name  \
0  SESA_2020_06_22       SESA  22/06/2020      public      Akem   Kingsley
1  SESA_2020_06_22       SESA  22/06/2020      public     Dalvi    Rohan G

    Username Student ID                 Last Access Availability  Final Exam  \
0   kakem_oc       None  2020-07-16 21:52:00.000000          Yes        91.0
1  b00813213  B00813213  2020-07-24 04:24:00.000000          Yes        97.0

  Final Grade
0      Passed
1      Passed

# Method for updating tables:

In [77]:
def updatemain(df, flag, dfname): 
    msg = ''
    if isinstance(df, bool)== False:
        tuples = list(df.itertuples(index=False, name=None))
        if flag == 'acl':
            for tup in tuples:            
                course_name, acronym, cost_model = tup
                msg = updateCourselistTable(course_name, acronym, 
                                     cost_model)
            msg = msg
        elif flag == 'reg':
            def replacespacer(col):
                tmp = [col.replace(' ', '_') for col in col]
                tmp = [col.strip(':') for col in tmp]
                tmp = [col.strip('?') for col in tmp]
                tmp = [col.replace('/', '_') for col in tmp]
                return tmp
            df.columns = replacespacer(df.columns)
            tuples = list(df.itertuples(index=False, name=None))            
            for tup in tuples: 
                course_id, course_abb, mmyyyy,\
                course_type, First_Name, Last_Name,\
                Email_Address, Address, City,State, \
                Education_Level, Country, ZIP_Code,\
                Phone, Company_School, Job_Title,\
                Department, How_did_you_hear_about_this_course,\
                Registration_Date, Registration_Status,\
                Payment_Status, Payment_Type, Fee_Type,\
                Promo_Code, Code_Type, Discount_Percent,\
                Discount_Amount, Total_Price = tup
                msg = updateRegistrantsTable(course_id, course_abb, mmyyyy,
                                       course_type, First_Name, Last_Name,
                                       Email_Address, Address, City,State, 
                                       Education_Level, Country, ZIP_Code,
                                       Phone, Company_School, Job_Title,
                                       Department, How_did_you_hear_about_this_course,
                                       Registration_Date, Registration_Status,
                                       Payment_Status, Payment_Type, Fee_Type, 
                                       Promo_Code, Code_Type, Discount_Percent,
                                       Discount_Amount, Total_Price)   
            msg = msg
        elif flag == 'dem':
            for tup in tuples:
                course_id, course_abb, mmyyyy, course_type,\
                object, by, count = tup
                msg = updateDemographyTable(course_id, course_abb, 
                                      mmyyyy, course_type,
                                      object, by, count) 
            msg = msg
            
        elif flag == 'gra':
            for tup in tuples:
                course_id,course_abb,mmyyyy,course_type,\
                Last_Name,First_Name,Username,\
                Student_ID,Last_Access, Availability,\
                Final_Exam, Final_Grade = tup
                msg = updateGradeTable(course_id,course_abb,
                                 mmyyyy,course_type,Last_Name,
                                 First_Name,Username, 
                                 Student_ID,Last_Access,
                                 Availability, Final_Exam, 
                                 Final_Grade) 
            msg = msg
            
        elif flag == 'cml':
            for tup in tuples:
                course_id, course_abb, mmyyyy, course_type,\
                    Name, Role, Pay, Type, Location = tup
                msg = updateCostTable(course_id, course_abb, mmyyyy, course_type,
                    Name, Role, Pay, Type, Location)  
            msg = msg
        elif flag == 'svy':
            for tup in tuples:
                course_id, course_abb, mmyyyy, course_type,\
                questions, opinion, scores, count = tup
                msg = updateSurveysTable(course_id, course_abb, mmyyyy, course_type,
                                   questions, opinion, scores, count) 
            msg = msg
        else:
            msg = f"{flag} doesn't match with any of the dataframes!"
    else:
        msg = f"{dfname} is empty!"     
    return msg

In [78]:
files = ['./DB_Tables/registrants.xlsx',
         './DB_Tables/grade_report.xlsx',
         './DB_Tables/course_list.xlsx',
         './DB_Tables/demography.xlsx',
         './DB_Tables/surveys.xlsx',
         './DB_Tables/cost_model.xlsx']
df = pd.read_excel(files[0])

In [79]:
msg = updatemain(df, 'reg', 'Registration')
msg

'Registrants_Table was updated successfully!'

## Convert grades to named to tuples

In [43]:
grades.head(2)

,course_id,course_abb,mmyyyy,course_type,Last Name,First Name,Username,Student ID,Last Access,Availability,Final Exam,Final Grade
0,SESA_2020_06_22,SESA,22/06/2020,public,Akem,Kingsley,kakem_oc,None,2020-07-16 21:52:00.000000,Yes,91.0,Passed
1,SESA_2020_06_22,SESA,22/06/2020,public,Dalvi,Rohan G,b00813213,B00813213,2020-07-24 04:24:00.000000,Yes,97.0,Passed

In [45]:
list(grades.itertuples(index=False))[0]

Pandas(course_id='SESA_2020_06_22', course_abb='SESA', mmyyyy='22/06/2020', course_type='public', _4='Akem', _5='Kingsley', Username='kakem_oc', _7=None, _8='2020-07-16 21:52:00.000000', Availability='Yes', _10=91.0, _11='Passed')

## Convert grades to unnamed tuples

In [47]:
list(grades.itertuples(index=False, name=None))[0]

('SESA_2020_06_22',
 'SESA',
 '22/06/2020',
 'public',
 'Akem',
 'Kingsley',
 'kakem_oc',
 None,
 '2020-07-16 21:52:00.000000',
 'Yes',
 91.0,
 'Passed')

## Update grade_report table using for loop

In [51]:
grade_tuples= list(grades.itertuples(index=False, name=None))
for tup in grade_tuples:
    course_id,course_abb,mmyyyy,course_type,Last_Name,\
    First_Name,Username, Student_ID,Last_Access,\
    Availability, Final_Exam, Final_Grade = tup
    print(updateGradeTable(course_id,course_abb,mmyyyy,course_type,Last_Name,
                 First_Name,Username, Student_ID,Last_Access,
                 Availability, Final_Exam, Final_Grade))

Grade_Table update faile due to no such column: Last_Name.
Grade_Table update faile due to no such column: Last_Name.
Grade_Table update faile due to no such column: Last_Name.
Grade_Table update faile due to no such column: Last_Name.
Grade_Table update faile due to no such column: Last_Name.
Grade_Table update faile due to no such column: Last_Name.
Grade_Table update faile due to no such column: Last_Name.
Grade_Table update faile due to no such column: Last_Name.
Grade_Table update faile due to no such column: Last_Name.
Grade_Table update faile due to no such column: Last_Name.

## All Database Names should be standard

In [4]:
# After installing with pip install psycopg2
import psycopg2 as pg2

# Intersection of two dataframe in Pandas – Python

In [137]:
import pandas as pd 

# Creating Data frames 
df1 = {'A': [1, 2, 3, 4], 
      'B': ['abc', 'def', 'efg', 'ghi']} 
df2 = {'A': [1, 2, 3, 4 ], 
       'B': ['Geeks', 'For', 'efg', 'ghi'], 
        'C':['Nikhil', 'Rishabh', 'Rahul', 'Shubham']}

In [139]:
d1 = pd.DataFrame(df1) 
d1

   A    B
0  1  abc
1  2  def
2  3  efg
3  4  ghi

In [140]:
d2 = pd.DataFrame(df2) 
d2

   A      B        C
0  1  Geeks   Nikhil
1  2    For  Rishabh
2  3    efg    Rahul
3  4    ghi  Shubham

In [141]:

# Calling merge() function 
int_df = pd.merge(d1, d2, how ='inner', on =['A', 'B']) 
int_df

   A    B        C
0  3  efg    Rahul
1  4  ghi  Shubham

In [142]:
import pandas as pd 

# Creating Data frames 
df1 = {'A': [1, 2, 3, 4], 
		'B': ['Geeks', 'For', 'efg', 'ghi']} 
df2 = {'A': [1, 2, 3, 4 ], 
		'B': ['Geeks', 'For', 'abc', 'cde'], 
		'C':['Nikhil', 'Rishabh', 'Rahul', 'Shubham']} 
		
d1 = pd.DataFrame(df1) 
d2 = pd.DataFrame(df2) 

# Calling merge() function 
int_df = pd.merge(d1, d2, how='inner', on=['A', 'B']) 
print(int_df)

   A      B        C
0  1  Geeks   Nikhil
1  2    For  Rishabh

# Pandas Difference Between two Dataframes

In [26]:
import pandas as pd

df1 = pd.DataFrame({'City': ['New York', 'Chicago', 'Tokyo', 'Paris','New Delhi'],
                     'Temp': [59, 29, 73, 56,48]})

df2 = pd.DataFrame({'City': ['London', 'New York', 'Tokyo', 'New Delhi','Paris'],
                     'Temp': [55, 55, 73, 85,56]})

In [27]:
df1

        City  Temp
0   New York    59
1    Chicago    29
2      Tokyo    73
3      Paris    56
4  New Delhi    48

In [28]:
df2

        City  Temp
0     London    55
1   New York    55
2      Tokyo    73
3  New Delhi    85
4      Paris    56

### Find Common Rows between two Dataframe Using Merge Function
Using the merge function you can get the matching rows between the two dataframes. So we are merging dataframe(df1) with dataframe(df2) and Type of merge to be performed is inner, which use intersection of keys from both frames, similar to a SQL inner join.

In [4]:
df = df1.merge(df2, how = 'inner' ,indicator=False)
df

    City  Temp
0  Tokyo    73
1  Paris    56

So what we get is Tokyo and Paris which is common between the two dataframes

In [7]:
def onlyInner(df, dbtbl):    
    if (isinstance(df, bool)==False)\
        and (isinstance(dbtbl, str)==False):
        try:
            inner = df.merge(dbtbl, how = 'inner',
                             indicator=False)            
        except:
            return False
        else:
            return inner       
    else:
        return False

In [8]:
onlyInner(df1, df2)

    City  Temp
0  Tokyo    73
1  Paris    56

In [15]:
def onlyInner2(df, dbtbl, cid):    
    if (isinstance(df, bool)==False)\
        and (isinstance(dbtbl, str)==False):
        try:
            dblst = dbtbl[cid].tolist()            
            inner = df[~df[cid].isin(dblst)]           
        except:
            return False
        else:
            return inner       
    else:
        return False

In [16]:
onlyInner2(df1, df2, 'City')

      City  Temp
1  Chicago    29

In [36]:
def getThoseNotInDB(df, dbtbl, cid):    
    if (isinstance(df, bool)==False)\
        and (isinstance(dbtbl, str)==False):
        try:
            dblst = dbtbl[cid].tolist()            
            inner = df[~df[cid].isin(dblst)]           
        except:
            return False
        else:
            return inner       
    else:
        return False

In [37]:
getThoseNotInDB(df1, df2, 'City')

      City  Temp
1  Chicago    29

In [35]:
def onlyInner3(df, dbtbl, cid):    
    if (isinstance(df, bool)==False)\
        and (isinstance(dbtbl, str)==False):
        try:
            dblst = dbtbl[cid].tolist()            
            inner = df[df[cid].isin(dblst)]           
        except:
            return False
        else:
            return inner       
    else:
        return False

In [34]:
onlyInner3(df1, df2, 'City')

      City  Temp
1  Chicago    29

### Find Common Rows Between Two Dataframes Using Concat Function
The concat function concatenate second dataframe(df2) below the first dataframe(df1) along a particular axis with optional set logic along the other axes. So here we are concating the two dataframes and then grouping on all the columns and find rows which have count greater than 1 because those are the rows common to both the dataframes. here is code snippet:

In [148]:
df = pd.concat([df1, df2])

df = df.reset_index(drop=True)

df_gpby = df.groupby(list(df.columns))

idx = [x[0] for x in df_gpby.groups.values() if len(x) != 1]
df.reindex(idx)

    City  Temp
3  Paris    56
2  Tokyo    73

### Find Rows in DF1 Which Are Not Available in DF2
We will see how to get all the rows in dataframe(df1) which are not available in dataframe(df2). We can use the same merge function as used above only the parameter indicator is set to true, which adds a column to output DataFrame called “_merge” with information on the source of each row. If string, column with information on source of each row will be added to output DataFrame, and column will be named value of string. Information column is Categorical-type and takes on a value of “left_only” for observations whose merge key only appears in ‘left’ DataFrame, “right_only” for observations whose merge key only appears in ‘right’ DataFrame, and “both” if the observation’s merge key is found in both

In [151]:
df = df1.merge(df2, how = 'outer' ,indicator=True).loc[lambda x : x['_merge']=='left_only']
df = df[df1.columns]
df

        City  Temp
0   New York    59
1    Chicago    29
4  New Delhi    48

In [154]:
def filtab(df, dbtab):    
    if (isinstance(df, bool)==False)\
        and (isinstance(dbtab, str)==False):
        try:
            diff = df.merge(dbtab, how = 'outer',indicator=True
                ).loc[lambda x : x['_merge']=='left_only']
            diff = diff[df.columns]
        except:
            return False
        else:
            return diff        
    else:
        return False

In [155]:
filtab(df1, df2)

        City  Temp
0   New York    59
1    Chicago    29
4  New Delhi    48

## Backup

In [186]:
errors = []
tdy = date.today()
y = tdy.strftime("%Y")
m = tdy.strftime("%B")
d = tdy.strftime("%d")
db_name = 'DashProjDB_'+y+'_'+m+'_'+d+'.db'        
shutil.copy(dbpath, path_4)
path_old = path_4+'DashProjDB.db'
path_new = path_4 + db_name
os.rename(r''+path_old,r''+path_new)
errors.append('Section-5: DB was successfully backed up!')

In [187]:
def backupDb(path_4, dbpath): 
    errors = []
    try:
        tdy = date.today()
        y = tdy.strftime("%Y")
        m = tdy.strftime("%B")
        d = tdy.strftime("%d")
        db_name = 'DashProjDB_'+y+'_'+m+'_'+d+'.db'        
        shutil.copy(dbpath, path_4)
        path_old = path_4+'DashProjDB.db'
        path_new = path_4 + db_name
        os.rename(r''+path_old,r''+path_new)
        errors.append('Section-5: DB was successfully backed up!')
    except:        
        errors.append('Section-5: DB is not backed up because the path'
                     +' is wrong!')
    return errors

In [188]:
import os
import shutil
from datetime import date,timedelta
cpath = "/home/alem/Desktop/dash/"
path_4 = os.path.join(cpath,"DB_Backups/")
dbpath = os.path.join(cpath,"py_and_db/DashProjDB.db")

In [189]:
backupDb(path_4, dbpath)

['Section-5: DB was successfully backed up!']